Bunkering_03/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    left
    {
        type            patch;
        nFaces          901;
        startFace       466455;
    }
    right
    {
        type            patch;
        nFaces          901;
        startFace       467356;
    }
    front
    {
        type            patch;
        nFaces          2185;
        startFace       468257;
    }
    back
    {
        type            patch;
        nFaces          1995;
        startFace       470442;
    }
    top
    {
        type            patch;
        nFaces          3896;
        startFace       472437;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2095;
        startFace       476333;
    }
    bunkering-boat_m
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11451;
        startFace       478428;
    }
    bunkering-quay_m
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11358;
        startFace       489879;
    }
    nozzle
    {
        type            patch;
        nFaces          36;
        startFace       501237;
    }
    nozzle_holder_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1314;
        startFace       501273;
    }
)

// ************************************************************************* //
