Bunkering_03/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    right
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    left
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    front
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    back
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    top
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    bottom
    {
        type            noSlip;
    }
    bunkering-boat_m
    {
        type            noSlip;
    }
    bunkering-quay_m
    {
        type            noSlip;
    }
    nozzle_holder_wall
    {
        type            noSlip;
    }
    nozzle
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            (0        (0 0 0))
            (0.01     (0 0 800))   // ramp from 0 to 100 m/s over 0.01 s
            (100      (0 0 800))   // hold at 100 m/s
        );
        value           uniform (0 0 0);
}    
}
// ************************************************************************* //
